[
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"DAM",
       "siglas":"SINF",
       "nombre":"Sistemas informáticos",
       "horasTotales":"180",
       "horasSemanales":"6",
       "resumen":"Aprenderás a configurar sistemas operativos como Windows y Linux y redes de comunicación",
       "descripcion":"Se estudian los equipos informáticos, sus componentes físicos, los sistemas operativos que se instalan en ellos y las herramientas básicas de gestión de la información. Además se estudian los protocolos de red que permiten al equipo conectarse a internet",
       "imagen":"SINF.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"DAM",
       "siglas":"BD",
       "nombre":"Bases de datos",
       "horasTotales":"185",
       "horasSemanales":"6",
       "resumen":"En este módulo se aprenderá el diseño, creación y manipulación de bases de datos así como la programación de las mismas",
       "descripcion":"Hoy en día la forma en cómo se comunica el mundo es más importante que nunca (para el mercado laboral y la sociedad en general), por ese motivo es fundamental la existencia de profesionales con excelentes cimientos en la manera en que los datos, su almacenamiento y procesamiento funcionan. En este módulo se estudia el diseño de las bases de datos pasando por el completo tratamiento de las mismas (creación, manipulación, control) pudiendo llevar a aplicar todo lo aprendido a los lenguajes de programación que juntos completan el proceso",
       "imagen":"BD.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"DAM",
       "siglas":"PROG",
       "nombre":"Programación",
       "horasTotales":"205",
       "horasSemanales":"6",
       "resumen":"Este módulo proporciona la base de programación en todos los estilos básicos: estructurada, funcional y orientada a objetos. ¿Todavía no sabes qué es esto?, si te matriculas lo sabrás",
       "descripcion":"El puesto de desarrollador es uno de los más demandados actualmente y no parece que vaya a cambiar esta tendencia, más bien al contrario. En este módulo aprenderás las habilidades básicas para pensar como un buen programador y sentarás los cimientos para aprender cualquier lenguaje de programación de cualquier estilo. Al finalizar el módulo serás capaz de desarrollar una aplicación de escritorio orientada a objetos con acceso a base de datos cumpliendo todos los requisitos que una aplicación profesional requiere. Este módulo es básico para la comprensión y aprendizaje de otros módulos de este (y otros) ciclos",
       "imagen":"PROG.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"DAM",
       "siglas":"LMSGI",
       "nombre":"Lenguajes de marcas y sistemas de gestión de información",
       "horasTotales":"134",
       "horasSemanales":"4",
       "resumen":"En este módulo aprenderás a crear páginas con HTML, CSS y Bootstrap, así como el modelado de datos con XML y su validación",
       "descripcion":"Comprender y saber utilizar correctamente las tecnologías básicas para crear páginas web es fundamental. En este módulo aprenderás a ello, además de ver tecnologías clave para el almacenamiento de información semiestructurada y su validación, según unos requisitos establecidos. Gracias a ello podrás diseñar posteriormente sistemas de información flexibles, adecuándose en cada momento a unos sistemas cambiantes, donde cómo estructurar la información que nos llega es fundamental",
       "imagen":"LMSGI.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"DAM",
       "siglas":"ED",
       "nombre":"Entornos de desarrollo",
       "horasTotales":"110",
       "horasSemanales":"3",
       "resumen":"Entornos de desarrollo es un módulo satélite del módulo de Programación. Aprenderás lo necesario sobre los programas que te ayudan a codificar y a planificar dichos programas",
       "descripcion":"Para ser un buen programador necesitas dominar, además de los conceptos de programación, los programas que te permiten generar dicho código y las herramientas que te ayudarán a realizar una planificación profesional del mismo. Igual que un procesador de textos te ayuda a escribir textos, los entornos de desarrollo te permiten codificar programas: en este módulo aprenderás a exprimir todas las opciones de los principales entornos del mercado. Por otro lado, siguiendo con los símiles, de la misma manera que una casa requiere de varios planos  para ser construida (topografía, plantas, cimentación, instalaciones…) el software necesita ser planificado también… Aquí aprenderás cómo hacerlo con diagramas UML",
       "imagen":"ED.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"DAM",
       "siglas":"AD",
       "nombre":"Acceso a datos",
       "horasTotales":"154",
       "horasSemanales":7,
       "resumen":"Acceso a todo tipo de información desde JAVA. Uso de datos del modelo relacional como si fueran objetos. Bases de datos orientadas o objeto y NOSQL",
       "descripcion":"Este módulo complementa a los de PROGRAMACIÓN, BASES DE DATOS Y LENGUAJES DE MARCAS. Accede a información grabada en disco y a cualquier sistema de información utilizando conectores de JAVA. Maneja información del modelo relacional como si fueran objetos. Creación, mantenimiento y consulta de bases de datos orientadas a objeto",
       "imagen":"AD.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"DAM",
       "siglas":"DSI",
       "nombre":"Desarrollo de interfaces",
       "horasTotales":"130",
       "horasSemanales":"7",
       "resumen":"Este módulo profesional contiene la formación necesaria para el desarrollo de interfaces de usuario, la creación de informes, la preparación de aplicaciones para su distribución, la elaboración de los elementos de ayuda y la evaluación del funcionamiento de aplicaciones",
       "descripcion":"El desarrollo de interfaces ha evolucionado mucho en los últimos años, basándose actualmente en el diseño de los mismos a través de lenguajes basados en XML. En este módulo se incidirá especialmente en el desarrollo basado en distintos patrones de diseño, tales como MVC o MVVM, lo que hará que nuestros alumnos desarrollen software de alta calidad. Por otro lado, tanto a la hora de generar informes como en el acceso a datos se practicará con tecnologías tradicionales como ADO.NET u otras más avanzadas y actuales como pueden ser la capa de persistencia Entity Model o el lenguaje LINQ para atacar cualquier origen de datos",
       "imagen":"DSI.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"DAM",
       "siglas":"PMDM",
       "nombre":"Programación multimedia y dispositivos móviles",
       "horasTotales":"99",
       "horasSemanales":"5",
       "resumen":"En este módulo se aprenderá las bases de la programación en dispositivos móviles, así como la realización de videojuegos y aplicaciones multimedia",
       "descripcion":"El desarrollo de app móviles es algo fundamental hoy en día pues todo el mundo quiere acceder a la información en cualquier momento y lugar. A lo largo de este módulo aprenderás a realizar tus apps móviles usando imágenes, sonido, tu cámara, los sensores disponibles o usando la localización y mapas. Accederás a información disponible en tu propio dispositivo o existente en el exterior a través de distintos servicios disponibles. También desarrollarás tus propios videojuegos diseñando distintos niveles con que podrás ejecutar en diferentes plataformas",
       "imagen":"PMDM.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"DAM",
       "siglas":"PSP",
       "nombre":"Programación de servicios y procesos",
       "horasTotales":"65",
       "horasSemanales":"3",
       "resumen":"Este módulo te permitirá dotar a tus programas de más funcionalidades: programación de hilos que son programas que corren a la vez en la máquina, técnicas que permiten conectar unos programas con otros a través de la red y herramientas para una codificación segura (encriptación y firmas electrónicas)",
       "descripcion":"Este módulo, pese a contar con poca carga horaria, desarrolla aspectos fundamentales de una programación avanzada; cuando necesitemos, por ejemplo, que nuestros programas realicen trabajos en segundo plano, se comuniquen por la red con otros programas y/o debamos codificar o firmar información delicada que sea procesada por la aplicación que estamos creando",
       "imagen":"PSP.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"DAM",
       "siglas":"SGE",
       "nombre":"Sistemas de gestión empresarial",
       "horasTotales":"65",
       "horasSemanales":"3",
       "resumen":"Programarás aplicaciones comerciales y de gestión analizando las paticularidades de la empresa y de la información subyacente",
       "descripcion":"En este módulo aprenderás a analizar las características de una empresa y de la información relevante con la que trabaja, para diseñar el sistema adecuado para ella instalando módulos definidos, o diseñando nuevos módulos con lenguajes como Python",
       "imagen":"SGE.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"DAW",
       "siglas":"SINF",
       "nombre":"Sistemas informáticos",
       "horasTotales":"180",
       "horasSemanales":"6",
       "resumen":"Aprenderás a configurar sistemas operativos como Windows y Linux y redes de comunicación",
       "descripcion":"Se estudian los equipos informáticos, sus componentes físicos, los sistemas operativos que se instalan en ellos y las herramientas básicas de gestión de la información. Además se estudian los protocolos de red que permiten al equipo conectarse a internet",
       "imagen":"SINF.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"DAW",
       "siglas":"BD",
       "nombre":"Bases de datos",
       "horasTotales":"185",
       "horasSemanales":"6",
       "resumen":"En este módulo se aprenderá el diseño, creación y manipulación de bases de datos así como la programación de las mismas",
       "descripcion":"Hoy en día la forma en cómo se comunica el mundo es más importante que nunca (para el mercado laboral y la sociedad en general), por ese motivo es fundamental la existencia de profesionales con excelentes cimientos en la manera en que los datos, su almacenamiento y procesamiento funcionan. En este módulo se estudia el diseño de las bases de datos pasando por el completo tratamiento de las mismas (creación, manipulación, control) pudiendo llevar a aplicar todo lo aprendido a los lenguajes de programación que juntos completan el proceso",
       "imagen":"BD.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"DAW",
       "siglas":"PROG",
       "nombre":"Programación",
       "horasTotales":"205",
       "horasSemanales":"6",
       "resumen":"Este módulo proporciona la base de programación en todos los estilos básicos: estructurada, funcional y orientada a objetos. ¿Todavía no sabes qué es esto?, si te matriculas lo sabrás",
       "descripcion":"El puesto de desarrollador es uno de los más demandados actualmente y no parece que vaya a cambiar esta tendencia, más bien al contrario. En este módulo aprenderás las habilidades básicas para pensar como un buen programador y sentarás los cimientos para aprender cualquier lenguaje de programación de cualquier estilo. Al finalizar el módulo serás capaz de desarrollar una aplicación de escritorio orientada a objetos con acceso a base de datos cumpliendo todos los requisitos que una aplicación profesional requiere. Este módulo es básico para la comprensión y aprendizaje de otros módulos de este (y otros) ciclos",
       "imagen":"PROG.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"DAW",
       "siglas":"LMSGI",
       "nombre":"Lenguajes de marcas y sistemas de gestión de información",
       "horasTotales":134,
       "horasSemanales":4,
       "resumen":"En este módulo aprenderás a crear páginas con HTML, CSS y Bootstrap, así como el modelado de datos con XML y su validación",
       "descripcion":"Comprender y saber utilizar correctamente las tecnologías básicas para crear páginas web es fundamental. En este módulo aprenderás a ello, además de ver tecnologías clave para el almacenamiento de información semiestructurada y su validación, según unos requisitos establecidos. Gracias a ello podrás diseñar posteriormente sistemas de información flexibles, adecuándose en cada momento a unos sistemas cambiantes, donde cómo estructurar la información que nos llega es fundamental",
       "imagen":"LMSGI.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"DAW",
       "siglas":"ED",
       "nombre":"Entornos de desarrollo",
       "horasTotales":"110",
       "horasSemanales":"3",
       "resumen":"Entornos de desarrollo es un módulo satélite del módulo de Programación. Aprenderás lo necesario sobre los programas que te ayudan a codificar y a planificar dichos programas",
       "descripcion":"Para ser un buen programador necesitas dominar, además de los conceptos de programación, los programas que te permiten generar dicho código y las herramientas que te ayudarán a realizar una planificación profesional del mismo. Igual que un procesador de textos te ayuda a escribir textos, los entornos de desarrollo te permiten codificar programas: en este módulo aprenderás a exprimir todas las opciones de los principales entornos del mercado. Por otro lado, siguiendo con los símiles, de la misma manera que una casa requiere de varios planos  para ser construida (topografía, plantas, cimentación, instalaciones…) el software necesita ser planificado también… Aquí aprenderás cómo hacerlo con diagramas UML",
       "imagen":"ED.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"DAW",
       "siglas":"DWEBC",
       "nombre":"Desarrollo web en entorno cliente",
       "horasTotales":"140",
       "horasSemanales":"7",
       "resumen":"En este módulo conseguiremos desarrollar, implantar, y mantener aplicaciones web, con independencia del modelo empleado y utilizando tecnologías específicas, garantizando el acceso a los datos de forma segura y cumpliendo los criterios de accesibilidad",
       "descripcion":"Desarrollaremos páginas web utilizando JavaScript con algunos de sus framework como JQuery, JQuery UI y otros como Angular utilizando, además, herramientas de control de versiones como GitHub. Todo esto mediante una metodología basada en proyectos y concretamente en el método Scrum, muy usado en las empresas de desarrollo de software. Trabajaremos en proyectos con aplicación real en ONGS o entidades sin ánimo de lucro",
       "imagen":"DWEBC.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"DAW",
       "siglas":"DWEBS",
       "nombre":"Desarrollo web en entorno servidor",
       "horasTotales":"180",
       "horasSemanales":"9",
       "resumen":"El desarrollo WEB es el más demandado actualmente, dentro del sector. En este módulo aprenderás lo básico de una parte de ese desarrollo WEB; programar el lado del servidor",
       "descripcion":"Toda aplicación WEB tiene dos partes principales FrontEnd y BackEnd. Cuando programamos la primera nos centramos en todo lo que ocurre en el navegador (esto se imparte en otro módulo de este ciclo); cuando programamos el lado BackEnd nos centramos en programar lo que ocurre cuando nuestra aplicación solicita datos u operaciones a un servidor. Por ejemplo, cuando accedes a tu correo electrónico: introduces tu usuario y contraseña para ver tus correos: todos esos datos que introduces y esos correos que se te proporcionan son gestionados en el lado del servidor con técnicas y lenguajes de programación que aprenderás en este módulo. De forma resumida veremos: programación clásica WEB con JSP/PHP, acceso y uso de servicios WEB y manejo de frameworks; los más demandados del mercado actualmente: Spring WEB/Laravel/Struts2",
       "imagen":"DWEBS.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"DAW",
       "siglas":"DAWEB",
       "nombre":"Despliegue de aplicaciones web",
       "horasTotales":94,
       "horasSemanales":5,
       "resumen":"Configurarás los servidores necesarios para poner en marcha tu proyecto web",
       "descripcion":"A lo largo de ese nódulo aprenderás a diseñar, implementar y montar la mejor infraestructura para tu proyecto web teniendo en cuenta las naturaleza del proyecto para elegir la solución más adecuada",
       "imagen":"DAWEB.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"DAW",
       "siglas":"DIW",
       "nombre":"Diseño de interfaces web",
       "horasTotales":"120",
       "horasSemanales":"6",
       "resumen":"En este módulo se aprenderá a planificar, diseñar e implementar interfaces web accesibles y usables aplicando especificaciones de diseño",
       "descripcion":"Independientemente de quién sea el usuario o consumidor de una página web, está clara la importancia de un diseño accesible, intuitivo, profesional y atractivo para mejorar la experiencia del usuario y por el impacto económico que tiene dicho diseño. En este módulo se planificarán, diseñarán e implementarán interfaces web valorando y aplicando especificaciones de diseño. Se prepararán archivos multimedia para la web y se integrarán todos los contenidos en documentos web seleccionando adecuadamente los elementos interactivos. Además se desarrollarán interfaces web accesibles y usables siguiendo las pautas establecidas",
       "imagen":"DIW.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"ASIR",
       "siglas":"ISO",
       "nombre":"Implantación de sistemas operativos",
       "horasTotales":"212",
       "horasSemanales":"7",
       "resumen":"En este módulo se aprenderá a configurar, administrar y mantener sistemas informáticos, garantizando la funcionalidad, la integridad de los recursos y servicios del sistema, con la calidad exigida y cumpliendola reglamentación vigente",
       "descripcion":"La importancia de la administración de sistemas informáticos radica en la cantidad de la información que se almacena y en la complejidad de su infraestructura. A lo largo de este módulo se aprenderá a instalar, configurar, administrar y mantener sistemas. Además, veremos cómo asegurar la información del sistema, centralizar la información en servidores administrando estructuras de dominios respetando requerimientos de seguridad. Detectaremos también problemas de rendimiento y auditaremos la utilización y acceso a los recursos",
       "imagen":"ISO.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"ASIR",
       "siglas":"PAR",
       "nombre":"Planificación y administración de redes",
       "horasTotales":"200",
       "horasSemanales":"6",
       "resumen":"En este módulo se aprenderán los principios básicos del funcionamiento de la red, diferentes algoritmos y protocolos de encaminamiento y a diseñar redes seguras fáciles de ampliar y gestionar",
       "descripcion":"La interconexión de redes es un elemento fundamental en la computación casi desde sus orígenes. Es difícil concebir hoy en día un sistema informático completamente aislado del exterior. Este módulo nos proporciona una visión global de las diferentes tecnologías, técnicas y sistemas para interconectar redes. A lo largo del desarrollo de este módulo aprenderás los conceptos básicos de las redes, sistemas de comunicación y transmisión, sistemas de numeración, arquitectura de red, redes de área local, etc. También aprenderás a diferenciar los tipos de señales, tipos de cables y conceptos como atenuación, distorsión y ruido a fin de solucionar los diferentes problemas que nos podremos encontrar a la hora de diseñar e implantar una red de computadoras en una organización",
       "imagen":"PAR.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"ASIR",
       "siglas":"FH",
       "nombre":"Fundamentos de hardware",
       "horasTotales":"134",
       "horasSemanales":"4",
       "resumen":"Reconoceremos e identificaremos cada uno de los componentes y dispositivos físicos que componen un sistema informático, pudiéndoles configurar y analizando sus características funcionales, para optimizar su rendimiento",
       "descripcion":"Conocer los componentes y cual es su función, ayuda a comprender el funcionamiento de una máquina, en nuestro caso, nuestra herramienta principal: los ordenadores. Cada uno de sus conectores, dispositi elementos auxiliares, sus funciones, como se instalan y configuran, con el objetivo de conseguir que funcionen y cumplan con su cometido final, el procesamiento automático de la información. Aprenderemos a desmontar y recomponer ordenadores de sobremesa, portátiles y daremos un paseíto por el mundo de los móviles, todo ello siguiendo los protocolos necesarios de seguridad, tanto personales, como de los componentes con los que trabajaremos",
       "imagen":"FH.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"ASIR",
       "siglas":"GBD",
       "nombre":"Gestión de bases de datos",
       "horasTotales":"134",
       "horasSemanales":"4",
       "resumen":"Diseño, mantenimiento y consulta de información en bases de datos",
       "descripcion":"Diseño del esquema de una base de datos normalizada para ser creada en un Sistema Gestor de Bases de datos. Tareas de mantenimiento para crear la estructura de una base de datos, introducir, borrar y modificar nuevos elementos y realizar copias de seguridad o importar/exportar datos de otras bases de datos. Consultas avanzadas a la información almacenada",
       "imagen":"GBD.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"ASIR",
       "siglas":"LMSGI",
       "nombre":"Lenguajes de marcas y sistemas de gestión de información",
       "horasTotales":"134",
       "horasSemanales":"4",
       "resumen":"En este módulo aprenderás a crear páginas con HTML, CSS y Bootstrap, así como el modelado de datos con XML y su validación",
       "descripcion":"Comprender y saber utilizar correctamente las tecnologías básicas para crear páginas web es fundamental. En este módulo aprenderás a ello, además de ver tecnologías clave para el almacenamiento de información semiestructurada y su validación, según unos requisitos establecidos. Gracias a ello podrás diseñar posteriormente sistemas de información flexibles, adecuándose en cada momento a unos sistemas cambiantes, donde cómo estructurar la información que nos llega es fundamental",
       "imagen":"LMSGI.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"ASIR",
       "siglas":"ASO",
       "nombre":"Administración de sistemas operativos",
       "horasTotales":"140",
       "horasSemanales":"7",
       "resumen":"Aprenderemos a administrar sistemas operativos como Linux y Windows Server y OSx, integrándolos en un mismo sistema, compartiendo sus recursos e implementando tecnologías como Docker, Xenserver, Centreon…",
       "descripcion":"No podemos entender el mundo de la informática sin la figura del administrador de sistemas. Su función es mantener todos los ordenadores y dispositivos que forman un sistema informático en perfecto funcionamiento. Según esto, aprenderemos a crear infraestructuras con varios equipos y sistemas operativos diferentes, que compartan recursos como aplicaciones, ficheros e impresoras. Conseguiremos qué si uno de esos ordenadores sufre una avería, nuestro sistema siga funcionando sin problema. Compartiremos información entre máquinas situadas en puntos remotos con total disponibilidad y seguridad de acceso. Programaremos tareas que nos permitirán obtener información sobre el estado general de nuestro sistema informático y ejecuten operaciones automáticas de mantenimiento. Algunos de los contenidos que estudiaremos será: AD, OpenLDAP, Samba, DFS, WDS, RDS, CUPS, Docker, Xenserver, Centreon, PowerShell",
       "imagen":"ASO.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"ASIR",
       "siglas":"SRI",
       "nombre":"Servicios de red e Internet",
       "horasTotales":"147",
       "horasSemanales":"7",
       "resumen":"¿Montar múltiples servidores y ver cómo administrarlos eficientemente? ¡Hecho!",
       "descripcion":"El modelo de servicios imperante a día de hoy en Internet es el cliente/servidor. Por suerte para tí, que tendrás mucho trabajo relacionado con este módulo. Aprenderás a instalar, configurar (eficientemente, por supuesto) y mantener diversos servidores: web, multimedia, ftp, dns, dhcp, etcétera. Y además aprenderás a hacer que sean servicios seguros y con redundancia de información. Todo ello es fundamental para mantener la estructura de los servicios que se ejecutan sobre Internet, básicos para el buen funcionamiento de todo sistema informático",
       "imagen":"SRI.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"ASIR",
       "siglas":"IAW",
       "nombre":"Implantación de aplicaciones web",
       "horasTotales":"91",
       "horasSemanales":"5",
       "resumen":"Realizarás aplicaciones web usando sistemas de gestión de contenidos y lenguajes específicos del lado del servidor como PHP",
       "descripcion":"Desarrollarás apliaciones web usandolenguajes scrpting como PHP, además de HTML y CSS manejando sesiones y acceso a datos. Además implantarás apliaciones usando sistemas gestores de contenidos como WordPress o Joomla.",
       "imagen":"IAW.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"ASIR",
       "siglas":"ASGBD",
       "nombre":"Administración de sistemas gestores de bases de datos",
       "horasTotales":"58",
       "horasSemanales":"3",
       "resumen":"Implementación y configuración de Sistemas Gestores de Bases de Datos. Control de acceso, Automatización de la administración, optimización y disponibilidad de la base datos",
       "descripcion":"Instalación y configuración de los parámetros de un Sistemas Gestor de base de datos tanto en la parte servidor como en la cliente. Acceso a los usuarios y asignación de permisos de acceso a la información. Creación y automatización de rutinas de administración de los datos. Monitorización y optimización para mejorar el rendimiento del sistema gestor de bases de datos",
       "imagen":"ASGBD.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"ASIR",
       "siglas":"SAD",
       "nombre":"Seguridad y alta disponibilidad",
       "horasTotales":"58",
       "horasSemanales":"3",
       "resumen":"Vulnerabilidades y medidas de seguridad y disponibilidad a tomar en un sistema informático a nivel lógico y físico y de red siguiendo la normativa legal",
       "descripcion":"Cada día es más preocupante la seguridad de los sistemas informáticos. En este módulo se estudiaran las vulnerabilidades, cómo detectarlas, explotarlas y sobre todo cómo corregirlas a través de diferentes talleres preparados en base a la información recibida del en Instituto Nacional de Ciberseguridad (INCIBE)",
       "imagen":"SAD.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"SMR",
       "siglas":"MMEI",
       "nombre":"Montaje y mantenimiento de equipos informáticos",
       "horasTotales":"235",
       "horasSemanales":"7",
       "resumen":"Sobre el montaje de los equipos componentes y software básico",
       "descripcion":"Se estudian los componentes de los equipos, sus características y procedimientos de montaje. Se instala el software básico y se realizan pruebas de rendimiento y esfuerzo",
       "imagen":"MMEI.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"SMR",
       "siglas":"SOM",
       "nombre":"Sistemas operativos monopuesto",
       "horasTotales":"192",
       "horasSemanales":"6",
       "resumen":"En este módulo se aprenderá a Instalar, configurar y administrar  los sistemas operativos monousuario más utilizados en la actualidad, como son Windows y Linux utilizando entornos gráficos y de línea de comandos",
       "descripcion":"El Sistema Operativo es el programa o software básico y más importante de un equipo informático. Las funciones básicas del Sistema Operativo son administrar los recursos del ordenador, coordinar el hardware y organizar los archivos y directorios del sistema. Los Sistemas Operativos más utilizados en la actualidad son Windows, Linux y Mac. En este módulo aprenderás cómo proceder a la instalación, configuración y administración de distintos sistemas operativos (Windows y Linux), atendiendo a diferentes casuísticas y optando por una solución óptima que se adapte a circunstancias específicas",
       "imagen":"SOM.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"SMR",
       "siglas":"RL",
       "nombre":"Redes locales",
       "horasTotales":"192",
       "horasSemanales":"6",
       "resumen":"En este módulo se aprenderá de las redes locales sus ventajas, protocolos, dispositivos de red, medios de transmisión, seguridad, protección, configuración de la red, comandos para detectar problemas en la red y su resolución",
       "descripcion":"La interconexión de redes es un elemento fundamental en la computación casi desde sus orígenes. Es difícil concebir hoy en día un sistema informático completamente aislado del exterior. En este módulo profesional se aprenderá a instalar y mantener una red, tanto la parte física como la lógica, variando las configuraciones y como soporte a servicios de red, con seguridad básica en la red y atendiendo a los riesgos laborales. Se detectarán y documentarán las incidencias, actuando en consecuencia",
       "imagen":"RL.png"
    },
    {
       "curso":"1",
       "cursoOrdinal":"primero",
       "cicloID":"SMR",
       "siglas":"AWEB",
       "nombre":"Aplicaciones Web",
       "horasTotales":"192",
       "horasSemanales":"6",
       "resumen":"Crearás tus aplicaciones basadas en tecnología web",
       "descripcion":"Conocerás las bases de HTML y CSS junto JavaScript y PHP para montar tus propias apliaciones web. Implantarás sistemas gestores de contenidos",
       "imagen":"AWEB.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"SMR",
       "siglas":"AO",
       "nombre":"Aplicaciones ofimáticas",
       "horasTotales":"192",
       "horasSemanales":"6",
       "resumen":"Manejarás aplicaciones ofimáticas y sus herramientas asociadas",
       "descripcion":"Utilizarás distintas herramientas ofimáticas para mejorar tu productividad, como procesaores de texto, hojas de cálculo, bases de datos o presentacones interactivas",
       "imagen":"AO.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"SMR",
       "siglas":"SOR",
       "nombre":"Sistemas operativos en red",
       "horasTotales":"150",
       "horasSemanales":"7",
       "resumen":"Este módulo consiste en instalar, configurar y mantener sistemas microinformáticos, aislados o en red, asegurando su funcionalidad y aplicando los protocolos de calidad, seguridad",
       "descripcion":"En este módulo se verá la instalación desde cero de distintos sistemas operativos en red, de forma que aprendamos a configurar la administración de los mismos, viendo el acceso a ellos desde distintos roles de usuarios, y cómo poder compartir sus recursos con seguridad, protegiendo tanto el acceso como la información compartida, y realizando de todo ello copias de seguridad, además de hacerlo en un entorno de red mixto, accediendo desde distintos sistemas operativos",
       "imagen":"SOR.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"SMR",
       "siglas":"SR",
       "nombre":"Servicios en red",
       "horasTotales":"128",
       "horasSemanales":"6",
       "resumen":"En este módulo adquirirás los conocimientos y habilidades necesarios para instalar y configurar los distintos tipos de servicios para las comunicaciones en red",
       "descripcion":"Hoy en día casi la totalidad de la información se encuentra distribuida en diferentes equipos alrededor del mundo, estos equipos necesitan ser configurados para ofrecer a los usuarios los servicios que demandan. Al cursar este módulo serás capaz de instalar y configurar los distintos tipos de servidores necesarios para las comunicaciones entre equipos conectados a una red como, servidores Web, de Correo Electrónico, DHCP, FTP y DNS, pudiendo configurar tus propios dominios",
       "imagen":"SR.png"
    },
    {
       "curso":"2",
       "cursoOrdinal":"segundo",
       "cicloID":"SMR",
       "siglas":"SI",
       "nombre":"Seguridad informática",
       "horasTotales":"104",
       "horasSemanales":"5",
       "resumen":"Configurarás medidas de seguridad básica para tus equipos informáticos y para distintos mecanismos de almacenamiento de la información",
       "descripcion":"Aplicarás distintas medidas de seguridad para proteger tus sistemas informáticoas y almacenamiento de la información de accesos no permitidos o de problemas de disponiblidad siguiendo las últimas tendencias tecnológicas",
       "imagen":"SI.png"
    }
 ]